#+TITLE: emacs configuration
#+OPTIONS: num:nil email:t
#+HTML_HEAD: <link rel=stylesheet href="http://auc-computing.nl/css/aucc.css" type="text/css">

mid 2024 emacs config luc

** user specific variables
#+BEGIN_SRC emacs-lisp
; Main
(setq my-fullname "Luc Weytingh")
(setq my-email "lucweytingh@pm.me")
(setq my-user-path "/Users/lucweytingh/")

; Additional
; SSH configuration
(setq ssh-config
      '(
        ("server" "/ssh:lucw@49.13.225.4:/home/lucw/" "(set-bash)")
        ("gc" "/ssh:lucw@94.130.183.250:/home/lucw/" "(set-bash)")
        ))


; Blacken is the Python auto-formatter. Uncomment and set this path to use it.
(setq my-blacken-executable (concat my-user-path ".local/bin/black"))
#+END_SRC

Find the blacken executable path by running
#+BEGIN_SRC shell
which black
#+END_SRC

#+RESULTS:
: ~/.local/bin/black

** whitespace management
#+BEGIN_SRC emacs-lisp
(use-package whitespace
  :ensure t
  :init (setq-default indicate-empty-lines t)
  :config
  (setq whitespace-line-column 80
        whitespace-style '(face trailing lines-tail empty
                                indentation::space space-before-tab::tab))
  (global-whitespace-mode -1))

(setq-default indent-tabs-mode nil)

(defcustom do-whitespace-cleanup t
  "Perform whitespace-cleanup on save."
  :group 'whitespace)

(make-variable-buffer-local 'do-whitespace-cleanup)

(defun toggle-whitespace-cleanup ()
  "Turn the whitespace-cleanup hook on and off."
  (interactive)
  (setq do-whitespace-cleanup (not do-whitespace-cleanup))
  (message "do-whitespace-cleanup set to %s" do-whitespace-cleanup))

(add-hook 'before-save-hook
          (lambda ()
            (when do-whitespace-cleanup
              (whitespace-cleanup))))

(add-hook 'makefile-mode-hook
          (lambda ()
            (setq indent-tabs-mode t
                  do-whitespace-cleanup nil)))

;; (add-hook 'prog-mode-hook
;;           (lambda ()
;;             (whitespace-mode +1)
;;             ;; (setq show-trailing-whitespace t)
;;             ))
(add-hook 'prog-mode-hook
          (lambda ()
            (unless (derived-mode-p 'c++-mode)  ;; Exclude C++ mode
              (whitespace-mode +1)
              ;; (setq show-trailing-whitespace t)
              )))
#+END_SRC

#+RESULTS:
| lambda | nil | (unless (derived-mode-p 'c++-mode) (whitespace-mode 1)) |
| lambda | nil | (whitespace-mode 1)                                     |

*** additional options
#+BEGIN_SRC emacs-lisp
  (set-face-attribute 'region nil :background (doom-darken "#c792ea" 0.6) :foreground nil)
  ;; "#ffffff"
#+END_SRC

#+RESULTS:

disable/enable horizontal line where point is
#+BEGIN_SRC emacs-lisp
(global-hl-line-mode 0)
(set-face-background 'hl-line (doom-darken "#c792ea" 0.77))
#+END_SRC

#+RESULTS:

# set font
#+BEGIN_SRC emacs-lisp
  ;; (set-face-font 'default "Roboto Mono 12")

  ;; (setq default-frame-alist
  ;;       (append (list '(vertical-scroll-bars . nil)
  ;;                     '(font . "Roboto Mono 12"))))


#+END_SRC

#+RESULTS:
: ((vertical-scroll-bars) (font . Roboto Mono 12))

*** window resizing
Define how to resize windows
#+BEGIN_SRC emacs-lisp
(defun resize-window (inc)
  (interagctive "p")
  (let* ((base (event-basic-type last-command-event))
           (step (pcase base
                   ((or ?f ?n) inc)
                   ((or ?b ?p) (- inc))))
           (horizontal (pcase base
                         ((or ?f ?b) t))))
      (enlarge-window step horizontal))
    (message "Use f,b,n,p to adjust window size")
    (set-transient-map (let ((map (make-sparse-keymap)))
    (define-key map "f" 'resize-window);;(lambda () (interactive "p") (resize-window 1)))
    (define-key map "b" 'resize-window)
    (define-key map "n" 'resize-window)
    (define-key map "p" 'resize-window)
    map)))

(global-set-key (kbd "C-x w f") (lambda () (interactive) (resize-window 1)))
(global-set-key (kbd "C-x w b") (lambda () (interactive) (resize-window 1)))
(global-set-key (kbd "C-x w n") (lambda () (interactive) (resize-window 1)))
(global-set-key (kbd "C-x w p") (lambda () (interactive) (resize-window 1)))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (resize-window 1) |
** indent rigidly (move selected regions)
#+BEGIN_SRC emacs-lisp
(use-package drag-stuff
  :straight t  ; Ensure the drag-stuff package is installed
  :config
  (drag-stuff-global-mode 1)  ; Enable drag-stuff globally if needed
  ;; Define a new global keymap for indenting and dragging
  (setq indent-rigidly-map (let ((map (make-sparse-keymap)))
                             (define-key map (kbd "C-p") 'drag-stuff-up)
                             (define-key map (kbd "C-n") 'drag-stuff-down)
                             (define-key map (kbd "C-f") 'drag-stuff-right)
                             (define-key map (kbd "C-b") 'drag-stuff-left)
                             (define-key map [left]  'indent-rigidly-left)
                             (define-key map (kbd "C-M-b")  'indent-rigidly-left)
                             (define-key map [right] 'indent-rigidly-right)
                             (define-key map (kbd "C-M-f") 'indent-rigidly-right)
                             (define-key map [S-right] 'indent-rigidly-right-to-tab-stop)
                             map)))
#+END_SRC

#+RESULTS:
: (keymap (S-right . indent-rigidly-right-to-tab-stop) (right . indent-rigidly-right) (27 keymap (6 . indent-rigidly-right) (2 . indent-rigidly-left)) (left . indent-rigidly-left) (2 . drag-stuff-left) (6 . drag-stuff-right) (14 . drag-stuff-down) (16 . drag-stuff-up))

** backup files location
#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist `(("." . "~/.saves")))
#+END_SRC

#+RESULTS:
: ((. . ~/.saves))

** html mode
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.html\\'" . html-mode))

(defun my-html-mode-keybindings ()
  "Ensure M-o runs ace-window in html-mode."
  (local-set-key (kbd "M-o") 'ace-window))

(add-hook 'html-mode-hook 'my-html-mode-keybindings)
#+END_SRC

#+RESULTS:
| my-html-mode-keybindings |

*** default template
Auto-insert when opening file with certain suffix.
#+BEGIN_SRC emacs-lisp
(defun insdate-insert-current-date (&optional omit-day-of-week-p)
  "Insert today's date using the current locale.
  With a prefix argument, the date is inserted without the day of
  the week."
  (interactive "P*")
  (calendar-date-string (calendar-current-date) nil
                        omit-day-of-week-p))

(defun my/org-template ()
  (let ((session-name (file-name-sans-extension (file-name-nondirectory buffer-file-name))))
    (message session-name)
    (insert
     (format  "#+BIND: org-export-use-babel nil
,#+TITLE: %s
,#+AUTHOR: %s
,#+EMAIL: %s
,#+DATE: %s
,#+LATEX: \\setlength\\parindent{0pt}
,#+LaTeX_HEADER: \\usepackage{minted}
,#+LATEX_HEADER: \\usepackage[margin=0.8in]{geometry}
,#+LATEX_HEADER_EXTRA:  \\usepackage{mdframed}
,#+LATEX_HEADER_EXTRA: \\BeforeBeginEnvironment{minted}{\\begin{mdframed}}
,#+LATEX_HEADER_EXTRA: \\AfterEndEnvironment{minted}{\\end{mdframed}}
,#+MACRO: NEWLINE @@latex:\\\\@@ @@html:<br>@@
,#+PROPERTY: header-args :exports both :session %s :cache :results value
,#+OPTIONS: ^:nil
,#+LATEX_COMPILER: pdflatex" (upcase-initials session-name) my-fullname my-email
(insdate-insert-current-date t) session-name)
     ;; (org-mode-restart)
     )))
(define-auto-insert "\\.org$" #'my/org-template)
  ;; ))
#+END_SRC

#+RESULTS:
: [my/org-template my/org-template]

**** auto indentation
Setting this variable causes auto-indentation inside org-mode src blocks
#+BEGIN_SRC emacs-lisp
(setq org-src-tab-acts-natively t
      org-src-preserve-indentation nil
      org-edit-src-content-indentation 0)
#+END_SRC

#+RESULTS:
: 0
**** general
#+BEGIN_SRC emacs-lisp
(require 'mode-local)
  (use-package auctex
    :defer t
    :ensure t
    :hook (LaTeX-mode-hook .
    electric-quote-local-mode)
    :config
    ;; Some LaTeX packages need to run a shell command, e.g. minted needs
    ;; pygmentize
    (push '("LaTeX-shell"
            "%`%l -shell-escape %(mode)%' %t"
            TeX-run-TeX
            nil
            (latex-mode doctex-mode)
            :help "Run LaTeX allowing shell escape")
          TeX-command-list)
    (setq font-latex-fontify-script nil)
    (setq-mode-local latex-mode region-extract-function latex--region-extract-function)
    (define-key "C-x n" 'move-windows)
    )


  ;; configs below need to be outside the use-package since org-mode may need
  ;; them directly.

  (setq TeX-view-program-list
        '(("mupdf" "/bin/mupdf %s.pdf"))
        TeX-view-program-selection
        '((output-pdf "PDF Tools")
          ;; (output-pdf "mupdf")
          ((output-dvi style-pstricks) "dvips and gv")
          (output-dvi "xdvi")
          (output-html "xdg-open"))
        TeX-source-correlate-start-server t
        LaTeX-electric-left-right-brace t)

;; TODO when using bibtex
;; (setq bibtex-completion-bibliography
;;       (mapcar (lambda (f)
;;                 (concat
;;                  "/path/to/media/data/tie/path/to/media/writing/bib/"
;;                  f
;;                  ".bib"))
;;               '("bon" "counting" "dsls" "etc")))

  ;; Update PDF buffers after successful LaTeX runs
  (add-hook 'TeX-after-compilation-finished-functions
            #'TeX-revert-document-buffer)

#+END_SRC

#+RESULTS:
| TeX-revert-document-buffer |

**** copying inside math mode
#+BEGIN_SRC emacs-lisp
(defun has-face-at (pos face-in-question &optional object)
  (let ((face-result-at-pos (get-text-property pos 'face object)))
    (if (eq (type-of face-result-at-pos) 'cons)
        (seq-contains face-result-at-pos face-in-question)
      (eq face-result-at-pos face-in-question))
    ))
;; (face-at-post ))


(defun latex--add-math-delimiters (substr)
  "add $ if necessary"
  (if (<= (length substr) 1)
      substr
    ;; (message (format "%s" (has-face-at  0 'font-latex-math-face substr)))
    (let*
        (;; (face-result-at-start (get-text-property 0 'face substr))
         ;; (face-at-start (if (eq (type-of face-result-at-start) 'cons) (first face-result-at-start) face-result-at-start))
         (substr-prefixed (if (and (not (string-prefix-p "$" substr))
                                   (has-face-at  0 'font-latex-math-face substr)
                                   )
                              (concat "$" substr)
                            substr))
         (substr-suffixed
          (if (and (not (string-suffix-p "$" substr-prefixed))
                   ;; (has-face-at  (- (length substr-prefixed) 1) 'font-latex-math-face substr-prefixed)
                   (has-face-at (- (length substr-prefixed) 1)
                                'font-latex-math-face substr-prefixed)
                   )
              (concat  substr-prefixed "$")
            substr-prefixed))
         )
      substr-suffixed
      )

    )
  )

(defvar latex--region-extract-function
  (lambda (method)
    (when (region-beginning)
      (cond
       ((eq method 'bounds)
        (list (cons (region-beginning) (region-end))))
       ((eq method 'delete-only)
        (delete-region (region-beginning) (region-end)))
       (t
        (latex--add-math-delimiters (filter-buffer-substring (region-beginning) (region-end) method))
        ;; (message out)
        ;; (message (latex--add-math-delimiters out))
        ))))
  "Function to get the region's content.
Called with one argument METHOD which can be:
- nil: return the content as a string (list of strings for
  non-contiguous regions).
- `delete-only': delete the region; the return value is undefined.
- `bounds': return the boundaries of the region as a list of one
  or more cons cells of the form (START . END).
- anything else: delete the region and return its content
  as a string (or list of strings for non-contiguous regions),
  after filtering it with `filter-buffer-substring', which
c  is called, for each contiguous sub-region, with METHOD as its
  3rd argument.")
(setq-mode-local latex-mode region-extract-function latex--region-extract-function)
#+END_SRC

#+RESULTS:
| lambda | (method) | (if (region-beginning) (progn (cond ((eq method 'bounds) (list (cons (region-beginning) (region-end)))) ((eq method 'delete-only) (delete-region (region-beginning) (region-end))) (t (latex--add-math-delimiters (filter-buffer-substring (region-beginning) (region-end) method)))))) |


Now let's also write a function that removes $'s if it's being copied inside a
math mode already. We need to adapt the =yank-handled-properties= variable

#+BEGIN_SRC emacs-lisp
(defun has-face (face-in-question face-seq))

(defun latex--possibly-remove-math-delimiters (face start end)
  ;; (message (format "%s" (seq-contains face 'font-latex-math-face)))
  ;; (message (format "%s" (get-text-property (+ start 1) :foreground)))
  (let* ((substr (buffer-substring start end))
         ;; (face-after (get-text-property (+ end 1) 'face ))
         ;; (face-before (get-text-property (- start 1) 'face ))
         (has-face-after (has-face-at (+ end 1) 'font-latex-math-face);; (get-text-property (+ end 1) 'face )
                         )
         (has-face-before (has-face-at (- start 1) 'font-latex-math-face);; (get-text-property (+ end 1) 'face )
                          )
         ;; (face-before (get-text-property (- start 1) 'face ))
         )
    (if (and (string-equal "$" substr)
             has-face-after has-face-before)
        (delete-region start end))))

(eval-after-load 'latex
  '(define-key LaTeX-mode-map  (kbd "C-x n") 'move-windows))

(defvar-mode-local latex-mode yank-handled-properties
  '((font-lock-face . yank-handle-font-lock-face-property)
    (face . latex--possibly-remove-math-delimiters)
    ;; ('foreground . latex--possibly-add-math-delimiters)
    (category . yank-handle-category-property)))


#+END_SRC

#+RESULTS:
: yank-handled-properties

** c++
#+BEGIN_SRC emacs-lisp
(use-package modern-cpp-font-lock
  :straight t)

(defun code-compile ()
  (interactive)
  (unless (file-exists-p "Makefile")
    (set (make-local-variable 'compile-command)
     (let ((file (file-name-nondirectory buffer-file-name)))
       (format "%s -o %s %s"
           (if  (equal (file-name-extension file) "cpp") "g++" "gcc" )
           (file-name-sans-extension file)
           file)))
    (compile compile-command)))

(global-set-key [f9] 'code-compile)



(use-package irony
  :straight t
  :config
  (progn
    ;; If irony server was never installed, install it.
    (unless (irony--find-server-executable) (call-interactively #'irony-install-server))

    (add-hook 'c++-mode-hook 'irony-mode)
    (add-hook 'c-mode-hook 'irony-mode)

    ;; Use compilation database first, clang_complete as fallback.
    (setq-default irony-cdb-compilation-databases '(irony-cdb-libclang
                                                      irony-cdb-clang-complete))

    (add-hook 'irony-mode-hook 'irony-cdb-autosetup-compile-options)
  ))

  ;; I use irony with company to get code completion.
  (use-package company-irony
    :straight t
    :after company irony
    :config
    (progn
      (eval-after-load 'company '(add-to-list 'company-backends 'company-irony))))

  ;; I use irony with flycheck to get real-time syntax checking.
  (use-package flycheck-irony
    :straight t
    :after flycheck irony
    :config
    (progn
      (eval-after-load 'flycheck '(add-hook 'flycheck-mode-hook #'flycheck-irony-setup))))

  ;; Eldoc shows argument list of the function you are currently writing in the echo area.
  (use-package irony-eldoc
    :straight t
    :after eldoc irony
    :config
    (progn
      (add-hook 'irony-mode-hook #'irony-eldoc)))


(defun my-c++-mode-settings ()
  (setq truncate-lines nil)
  (local-set-key (kbd "C-c C-c") 'nap-build-app)
  )

(add-hook 'c++-mode-hook 'my-c++-mode-settings)


(defun switch-cpp-h-file ()
  "Switch between .cpp and .h file with the same base name."
  (interactive)
  (let* ((file (buffer-file-name))
         (base-name (file-name-sans-extension file))
         (extension (file-name-extension file))
         (counterpart (cond ((string-equal extension "cpp") (concat base-name ".h"))
                            ((string-equal extension "h") (concat base-name ".cpp"))
                            (t nil))))
    (if (and counterpart (file-exists-p counterpart))
        (find-file counterpart)
      (message "No corresponding .cpp or .h file found."))))

;; Bind the function to C-c o
(global-set-key (kbd "C-c o") 'switch-cpp-h-file)
#+END_SRC

#+RESULTS:
| my-c++-mode-settings | nap-insert-template-if-new-file |

** supercollider
#+BEGIN_SRC emacs-lisp
;; Automatically clone the SuperCollider's scel repo if not already cloned
(let ((scel-repo-dir (concat user-emacs-directory "repos/scel")))
  (unless (file-directory-p scel-repo-dir)
    (shell-command
     (concat "git clone https://github.com/supercollider/scel.git " scel-repo-dir))))

;; Add SuperCollider's scel directory to load path
(add-to-list 'load-path (concat user-emacs-directory "repos/scel/el"))

;; Load sclang-mode
(require 'sclang)

;; Automatically enable sclang-mode for .scd files
(add-to-list 'auto-mode-alist '("\\.scd\\'" . sclang-mode))

;; Optional hook for customization
(add-hook 'sclang-mode-hook
          (lambda ()
            (turn-on-font-lock))) ;; Enable syntax highlighting


#+END_SRC

#+RESULTS:
| lambda | nil | (turn-on-font-lock)                                                                                            |                                                         |
| lambda | nil | (if (string= (buffer-name) sclang-post-buffer) (progn (setq mode-line-format '(- sclang-server-info-string)))) | (define-key sclang-mode-map  sclang-server-key-map) |
